jmeter/healthcare_api_load_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Healthcare API Comprehensive Load Test">
      <stringProp name="TestPlan.comments">Full CRUD coverage for Patients, Doctors, Stays, and Medical Acts</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">8085</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="THREADS" elementType="Argument">
            <stringProp name="Argument.name">THREADS</stringProp>
            <stringProp name="Argument.value">5</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="RAMP_UP" elementType="Argument">
            <stringProp name="Argument.name">RAMP_UP</stringProp>
            <stringProp name="Argument.value">10</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DURATION" elementType="Argument">
            <stringProp name="Argument.name">DURATION</stringProp>
            <stringProp name="Argument.value">60</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TOKEN" elementType="Argument">
            <stringProp name="Argument.name">TOKEN</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiJsb2FkdGVzdHVzZXIzIiwiaWF0IjoxNzY2NTI4NzMxLCJleHAiOjE3NjY2MTUxMzF9.S2t1geFQ5iLj6zWf3Zo9_VayhlRNQRBMyhjhOl4PPnCXTp266R-YibDgmd0JYobYAYZMnQ2_TODD6pb8uZ-Xdg</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.concurrentDwn">true</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${TOKEN}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Healthcare API Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_UP}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="SCENARIO: Patient Lifecycle" enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
            <!-- 1. CREATE PATIENT -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Create Patient" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <stringProp name="Argument.value">{&#xd;
    &quot;nom&quot;: &quot;Test${__RandomString(5,ABCDEFGHIJKLMNOPQRSTUVWXYZ)}&quot;,&#xd;
    &quot;prenom&quot;: &quot;User${__RandomString(5,abcdefghijklmnopqrstuvwxyz)}&quot;,&#xd;
    &quot;numeroSecuriteSociale&quot;: &quot;${__Random(100000000,999999999)}${__Random(100000,999999)}&quot;,&#xd;
    &quot;dateNaissance&quot;: &quot;1990-01-01&quot;,&#xd;
    &quot;sexe&quot;: &quot;M&quot;,&#xd;
    &quot;adresse&quot;: &quot;123 Test St&quot;,&#xd;
    &quot;telephone&quot;: &quot;0102030405&quot;,&#xd;
    &quot;email&quot;: &quot;test${__UUID}@example.com&quot;&#xd;
}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.path">/api/patients</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
            </HTTPSamplerProxy>
            <hashTree>
                <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Patient ID" enabled="true">
                    <stringProp name="RegexExtractor.useHeaders">false</stringProp>
                    <stringProp name="RegexExtractor.refname">PATIENT_ID</stringProp>
                    <stringProp name="RegexExtractor.regex">&quot;id&quot;:(\d+)</stringProp>
                    <stringProp name="RegexExtractor.template">$1$</stringProp>
                    <stringProp name="RegexExtractor.default">0</stringProp>
                    <stringProp name="RegexExtractor.match_number">1</stringProp>
                </RegexExtractor>
                <hashTree/>
            </hashTree>

            <!-- 2. CREATE MEDECIN -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Create Medecin" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <stringProp name="Argument.value">{&#xd;
    &quot;nom&quot;: &quot;Dr${__RandomString(5,ABCDEFGHIJKLMNOPQRSTUVWXYZ)}&quot;,&#xd;
    &quot;prenom&quot;: &quot;Medecin${__RandomString(3,abc)}&quot;,&#xd;
    &quot;numeroInscription&quot;: &quot;MED${__Random(10000,99999)}&quot;,&#xd;
    &quot;specialite&quot;: &quot;Cardiologie&quot;,&#xd;
    &quot;telephone&quot;: &quot;0600000000&quot;,&#xd;
    &quot;email&quot;: &quot;dr.${__UUID}@hospital.com&quot;,&#xd;
    &quot;serviceId&quot;: 1,&#xd;
    &quot;statut&quot;: &quot;ACTIF&quot;&#xd;
}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.path">/api/medecins</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
            </HTTPSamplerProxy>
            <hashTree>
                <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Medecin ID" enabled="true">
                    <stringProp name="RegexExtractor.useHeaders">false</stringProp>
                    <stringProp name="RegexExtractor.refname">MEDECIN_ID</stringProp>
                    <stringProp name="RegexExtractor.regex">&quot;id&quot;:(\d+)</stringProp>
                    <stringProp name="RegexExtractor.template">$1$</stringProp>
                    <stringProp name="RegexExtractor.default">0</stringProp>
                    <stringProp name="RegexExtractor.match_number">1</stringProp>
                </RegexExtractor>
                <hashTree/>
            </hashTree>

            <!-- 3. CREATE SEJOUR -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Create Sejour" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <stringProp name="Argument.value">{&#xd;
    &quot;patientId&quot;: ${PATIENT_ID},&#xd;
    &quot;serviceId&quot;: 1,&#xd;
    &quot;dateEntree&quot;: &quot;${__time(yyyy-MM-dd'T'HH:mm:ss,)}&quot;,&#xd;
    &quot;motif&quot;: &quot;Urgence Test&quot;,&#xd;
    &quot;diagnostic&quot;: &quot;Diagnostic Test&quot;,&#xd;
    &quot;statut&quot;: &quot;EN_COURS&quot;,&#xd;
    &quot;typeAdmission&quot;: &quot;URGENCE&quot;&#xd;
}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.path">/api/sejours</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
            </HTTPSamplerProxy>
            <hashTree>
                <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Sejour ID" enabled="true">
                    <stringProp name="RegexExtractor.useHeaders">false</stringProp>
                    <stringProp name="RegexExtractor.refname">SEJOUR_ID</stringProp>
                    <stringProp name="RegexExtractor.regex">&quot;id&quot;:(\d+)</stringProp>
                    <stringProp name="RegexExtractor.template">$1$</stringProp>
                    <stringProp name="RegexExtractor.default">0</stringProp>
                    <stringProp name="RegexExtractor.match_number">1</stringProp>
                </RegexExtractor>
                <hashTree/>
            </hashTree>

            <!-- 4. CREATE ACTE -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Create Acte" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <stringProp name="Argument.value">{&#xd;
    &quot;sejourId&quot;: ${SEJOUR_ID},&#xd;
    &quot;code&quot;: &quot;ACT${__Random(100,999)}&quot;,&#xd;
    &quot;libelle&quot;: &quot;Acte Test&quot;,&#xd;
    &quot;type&quot;: &quot;CONSULTATION&quot;,&#xd;
    &quot;dateRealisation&quot;: &quot;${__time(yyyy-MM-dd'T'HH:mm:ss,)}&quot;,&#xd;
    &quot;tarif&quot;: 25.0,&#xd;
    &quot;medecin&quot;: &quot;Dr Test&quot;,&#xd;
    &quot;notes&quot;: &quot;Ras&quot;&#xd;
}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.path">/api/actes</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
            </HTTPSamplerProxy>
            <hashTree>
                <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Acte ID" enabled="true">
                    <stringProp name="RegexExtractor.useHeaders">false</stringProp>
                    <stringProp name="RegexExtractor.refname">ACTE_ID</stringProp>
                    <stringProp name="RegexExtractor.regex">&quot;id&quot;:(\d+)</stringProp>
                    <stringProp name="RegexExtractor.template">$1$</stringProp>
                    <stringProp name="RegexExtractor.default">0</stringProp>
                    <stringProp name="RegexExtractor.match_number">1</stringProp>
                </RegexExtractor>
                <hashTree/>
            </hashTree>

            <!-- 5. VERIFY GETs (Read) -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Patient" enabled="true">
              <stringProp name="HTTPSampler.path">/api/patients/${PATIENT_ID}</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Medecin" enabled="true">
              <stringProp name="HTTPSampler.path">/api/medecins/${MEDECIN_ID}</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Sejour" enabled="true">
              <stringProp name="HTTPSampler.path">/api/sejours/${SEJOUR_ID}</stringProp>
              <stringProp name="HTTPSampler.method">GET</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>

            <!-- 6. UPDATE (Put) -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="PUT Update Acte" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <stringProp name="Argument.value">{&#xd;
    &quot;id&quot;: ${ACTE_ID},&#xd;
    &quot;sejourId&quot;: ${SEJOUR_ID},&#xd;
    &quot;code&quot;: &quot;MOD${__Random(100,999)}&quot;,&#xd;
    &quot;libelle&quot;: &quot;Acte Modifie&quot;,&#xd;
    &quot;type&quot;: &quot;CHIRURGIE&quot;,&#xd;
    &quot;dateRealisation&quot;: &quot;${__time(yyyy-MM-dd'T'HH:mm:ss,)}&quot;,&#xd;
    &quot;tarif&quot;: 50.0,&#xd;
    &quot;medecin&quot;: &quot;Dr Update&quot;,&#xd;
    &quot;notes&quot;: &quot;Updated&quot;&#xd;
}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.path">/api/actes/${ACTE_ID}</stringProp>
              <stringProp name="HTTPSampler.method">PUT</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>

            <!-- 7. DELETE (Cleanup in reverse order) -->
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="DELETE Acte" enabled="true">
              <stringProp name="HTTPSampler.path">/api/actes/${ACTE_ID}</stringProp>
              <stringProp name="HTTPSampler.method">DELETE</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>
            
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="DELETE Sejour" enabled="true">
              <stringProp name="HTTPSampler.path">/api/sejours/${SEJOUR_ID}</stringProp>
              <stringProp name="HTTPSampler.method">DELETE</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>

            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="DELETE Medecin" enabled="true">
              <stringProp name="HTTPSampler.path">/api/medecins/${MEDECIN_ID}</stringProp>
              <stringProp name="HTTPSampler.method">DELETE</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>

            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="DELETE Patient" enabled="true">
              <stringProp name="HTTPSampler.path">/api/patients/${PATIENT_ID}</stringProp>
              <stringProp name="HTTPSampler.method">DELETE</stringProp>
            </HTTPSamplerProxy>
            <hashTree/>

        </hashTree>

        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">debug_full.xml</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>